Handling Missing Data

In [34]:
"""            Trade-Offs in Missing Data Conventions                 """

'            Trade-Offs in Missing Data Conventions                 '

In [35]:
"""                      Missing Data in Pandas                       """

'                      Missing Data in Pandas                       '

In [36]:
# None: Pythonic missing data

In [37]:
import numpy as np
import pandas as pd

In [38]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [39]:
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
36.1 ms ± 385 μs per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype = int
1.54 ms ± 188 μs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [40]:
# NaN: Missing numerical data

In [41]:
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

In [42]:
1 + np.nan    # nan
0 * np.nan    # nan

nan

In [43]:
vals2.sum(), vals2.min(), vals2.max()
# (nan, nan, nan)

(np.float64(nan), np.float64(nan), np.float64(nan))

In [44]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)
# (8.0, 1.0, 4.0)

(np.float64(8.0), np.float64(1.0), np.float64(4.0))

In [45]:
# NaN and None in Pandas

In [46]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [47]:
x = pd.Series(range(2), dtype= int)
x

0    0
1    1
dtype: int64

In [48]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

In [49]:
"""                       Operating on Null Value                     """

'                       Operating on Null Value                     '

In [50]:
# Detecting null values

In [51]:
data = pd.Series([1, np.nan, "Hello", None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [52]:
data[data.notnull()]

0        1
2    Hello
dtype: object

In [53]:
data.dropna()

0        1
2    Hello
dtype: object

In [54]:
df = pd.DataFrame([[1, np.nan, 2],
                  [2, 3, 5],
                  [np.nan, 4, 6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [55]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [56]:
df.dropna(axis = "columns")

   2
0  2
1  5
2  6

In [57]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [58]:
df.dropna(axis= "columns", how = "all")

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [59]:
df.dropna(axis = "rows", thresh= 3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [60]:
data = pd.Series([1, np.nan, 2, None, 3], index = list("abcde"))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [61]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [62]:
data.fillna(method = "ffill")

C:\Users\Asus\AppData\Local\Temp\ipykernel_7920\3381289140.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method = "ffill")

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [63]:
data.fillna(method = "bfill")

C:\Users\Asus\AppData\Local\Temp\ipykernel_7920\1641773421.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method = "bfill")

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [64]:
df.fillna(method = "ffill", axis = 1)

C:\Users\Asus\AppData\Local\Temp\ipykernel_7920\2054155988.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = "ffill", axis = 1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [65]:
"""                                Examples                           """

'                                Examples                           '

In [66]:
import numpy as np
import pandas as pd

In [67]:
s = pd.Series([10, None, 20, np.nan, 30, None])
s

0    10.0
1     NaN
2    20.0
3     NaN
4    30.0
5     NaN
dtype: float64

In [68]:
s.dropna()

0    10.0
2    20.0
4    30.0
dtype: float64

In [83]:
df = pd.DataFrame([[1, np.nan, 2],
                   [np.nan, 3, 4],
                   [5, 6, np.nan]]
                   )
nan = df.dropna(how= "any", axis = 0)
print (nan)

Empty DataFrame
Columns: [0, 1, 2]
Index: []

In [85]:
s = pd.Series([1, np.nan, None, 4]).fillna(value = 0)
s

0    1.0
1    0.0
2    0.0
3    4.0
dtype: float64

In [87]:
s = pd.Series([1, np.nan, 2, None, 3]).fillna(method = "ffill")
s

C:\Users\Asus\AppData\Local\Temp\ipykernel_7920\3195970382.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s = pd.Series([1, np.nan, 2, None, 3]).fillna(method = "ffill")

0    1.0
1    1.0
2    2.0
3    2.0
4    3.0
dtype: float64

In [89]:
s = pd.Series([np.nan, 1, None, 2, np.nan]).fillna(method = "bfill")
s

C:\Users\Asus\AppData\Local\Temp\ipykernel_7920\2848523153.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s = pd.Series([np.nan, 1, None, 2, np.nan]).fillna(method = "bfill")

0    1.0
1    1.0
2    2.0
3    2.0
4    NaN
dtype: float64

In [91]:
df = pd.DataFrame([[np.nan, np.nan, np.nan],
                   [1, np.nan, 3],
                   [np.nan, 2, 3]]).dropna(how= "all")

df

     0    1    2
1  1.0  NaN  3.0
2  NaN  2.0  3.0

In [94]:
df = pd.DataFrame([[np.nan, 1, np.nan],
                   [1, 2, 3],
                   [np.nan, np.nan, 3]]).dropna(thresh= 2)
df

     0    1    2
1  1.0  2.0  3.0

In [109]:
s = pd.Series([10, None, 20, np.nan, 30])
s_notna = s[s.notna()]
s_notna

0    10.0
2    20.0
4    30.0
dtype: float64

In [112]:
df = pd.DataFrame([[1, np.nan, 3],
                   [np.nan, 5, np.nan],
                   [7, np.nan, 9]]).fillna(method = "ffill", axis = 1)
df

C:\Users\Asus\AppData\Local\Temp\ipykernel_7920\1583424773.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  [7, np.nan, 9]]).fillna(method = "ffill", axis = 1)

     0    1    2
0  1.0  1.0  3.0
1  NaN  5.0  5.0
2  7.0  7.0  9.0